run/conjugateBatteryCC_Ratio_Voltage/0/solid/solidConductivity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      solidConductivity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform 1000000;

boundaryField
{
    steelInterface
    {
        type            regionCoupling;
        remoteField     conductivity;
        value           $internalField;
    }
    lithiumInterface
    {
        type            regionCoupling;
        remoteField     conductivity;
        value           $internalField;
    }
    outsideSurface
    {
        type            zeroGradient;
    }
    topSurface
    {
        type            zeroGradient;
    }
    topLithium
    {
        type            zeroGradient;
    }
    topAttachmentPoint
    {
	type            zeroGradient;
    }
    outerAttachmentPoint
    {
	type            zeroGradient;
    }
}

// ************************************************************************* //
