run/conjugateBatteryCC_Ratio_Voltage/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

h 0.03;
dz 0.001;

defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volScalarFieldValue conductivity 187.1
);

regions
(
    boxToCell
    {
        box (-10 -10 -10) (10 10 $h+$dz);
        fieldValues
        (
            volScalarFieldValue alpha1 1
	    volScalarFieldValue conductivity 390593.55
        );
    }
    boxToCell
    {
        box (-10 -10 -10) (10 10 $h);
        fieldValues
        (
            volScalarFieldValue alpha1 1
	    volScalarFieldValue conductivity 781000
        );
    }
);

// ************************************************************************* //
